dashboard/app/views/home/dashboard.html.erb

SELECT COUNT(*) AS "count_all", "stock_prices_daily"."symbol" AS "stock_prices_daily_symbol" FROM "stock_prices_daily" GROUP BY "stock_prices_daily"."symbol"
---
      </canvas> %>
      <%= pie_chart StockPricesDaily.group(:symbol).count %>