dashboard/app/views/home/dashboard.html.erb

      </canvas> %>
      <%= area_chart StockPricesWeekly.group_by_week(:timestamp).count %>
---
SELECT "stock_prices_weeklies".* FROM "stock_prices_weeklies" WHERE ("stock_prices_weeklies"."timestamp" IS NOT NULL) GROUP BY DATE_TRUNC('day', "stock_prices_weeklies"."timestamp"::timestamptz AT TIME ZONE 'Etc/UTC')::date
SELECT COUNT(*) AS "count_all", DATE_TRUNC('day', "stock_prices_weeklies"."timestamp"::timestamptz AT TIME ZONE 'Etc/UTC')::date AS "date_trunc_day_stock_prices_weeklies_timestamp_timestamptz_at_t" FROM "stock_prices_weeklies" WHERE ("stock_prices_weeklies"."timestamp" IS NOT NULL) GROUP BY DATE_TRUNC('day', "stock_prices_weeklies"."timestamp"::timestamptz AT TIME ZONE 'Etc/UTC')::date
SELECT "stock_prices_weekly".* FROM "stock_prices_weekly" WHERE ("stock_prices_weekly"."timestamp" IS NOT NULL) GROUP BY (DATE_TRUNC('day', "stock_prices_weekly"."timestamp"::timestamptz AT TIME ZONE 'Etc/UTC' - INTERVAL '1 day' * ((7 + EXTRACT(DOW FROM "stock_prices_weekly"."timestamp"::timestamptz AT TIME ZONE 'Etc/UTC')::integer) % 7)))::date
SELECT COUNT(*) AS "count_all", (DATE_TRUNC('day', "stock_prices_weekly"."timestamp"::timestamptz AT TIME ZONE 'Etc/UTC' - INTERVAL '1 day' * ((7 + EXTRACT(DOW FROM "stock_prices_weekly"."timestamp"::timestamptz AT TIME ZONE 'Etc/UTC')::integer) % 7)))::date AS "date_trunc_day_stock_prices_weekly_timestamp_timestamptz_at_tim" FROM "stock_prices_weekly" WHERE ("stock_prices_weekly"."timestamp" IS NOT NULL) GROUP BY (DATE_TRUNC('day', "stock_prices_weekly"."timestamp"::timestamptz AT TIME ZONE 'Etc/UTC' - INTERVAL '1 day' * ((7 + EXTRACT(DOW FROM "stock_prices_weekly"."timestamp"::timestamptz AT TIME ZONE 'Etc/UTC')::integer) % 7)))::date