dashboard/app/views/home/weekly.html.erb

SELECT "stock_prices_weekly"."symbol" FROM "stock_prices_weekly"
---
                                    <%= form_tag({ action: "weekly" }, method: "get", class: "filter-form") do %>
                                    <%= select_tag(:symbol, options_for_select(StockPricesWeekly.pluck(:symbol).uniq, params[:symbol]), include_blank: true, class: "form-control form-control-sm", id: "symbol-filter") %>

SELECT "stock_prices_weekly"."year_month", "stock_prices_weekly"."average_price" FROM "stock_prices_weekly" WHERE "stock_prices_weekly"."symbol" = $1  [["symbol", "UBP"]]
---
                            <% if params[:symbol].present? %>
                                <% selected_symbol_data = StockPricesWeekly.where(symbol: params[:symbol]).pluck(:year_month, :average_price) %>

SELECT "stock_prices_weekly"."year_month", "stock_prices_weekly"."average_price" FROM "stock_prices_weekly"
---
                            <% else %>
                                <%= area_chart StockPricesWeekly.pluck(:year_month, :average_price), **chart_options %>