dashboard/app/controllers/home_controller.rb

  def weekly
    # Get the data for the table
    @stock_prices = StockPricesWeekly.where("(symbol, timestamp) IN (
      SELECT symbol, MAX(timestamp)
      FROM stock_prices_weekly
      GROUP BY symbol
      )").all

    # Get the selected symbol from the company filter
    company = params[:company_weekly]

    # Data for the area-chart
    @weekly_stock_prices = StockPricesWeekly.order(timestamp: :asc).all
    @companies = StockPricesWeekly.distinct.pluck(:symbol) # get all companies



    # Get the ave %chg per symbol throught the year
    @ave_chg_per_year = StockPricesWeekly.select('symbol, AVG(percent_change) AS ave_change, "timestamp"')
                          .where("EXTRACT(YEAR FROM timestamp) = ?", 2023)
                          .group('symbol, "timestamp"')
                          .where(symbol: company)
---
SELECT "stock_prices_weekly"."symbol", *, AVG(percent_change) AS percent_change FROM "stock_prices_weekly" WHERE "stock_prices_weekly"."symbol" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) GROUP BY "stock_prices_weekly"."symbol", "stock_prices_weekly"."timestamp"  [["symbol", "AAPL"], ["symbol", "MSFT"], ["symbol", "GOOGL"], ["symbol", "AMZN"], ["symbol", "TSLA"], ["symbol", "AAA"], ["symbol", "SM"], ["symbol", "TEL"], ["symbol", "GLO"], ["symbol", "UBP"]]
SELECT AVG("stock_prices_weekly"."average_price") AS "average_average_price", (DATE_TRUNC('day', "stock_prices_weekly"."timestamp"::timestamptz AT TIME ZONE 'Etc/UTC' - INTERVAL '1 day' * ((7 + EXTRACT(DOW FROM "stock_prices_weekly"."timestamp"::timestamptz AT TIME ZONE 'Etc/UTC')::integer) % 7)))::date AS "date_trunc_day_stock_prices_weekly_timestamp_timestamptz_at_tim" FROM "stock_prices_weekly" WHERE ("stock_prices_weekly"."timestamp" IS NOT NULL) GROUP BY (DATE_TRUNC('day', "stock_prices_weekly"."timestamp"::timestamptz AT TIME ZONE 'Etc/UTC' - INTERVAL '1 day' * ((7 + EXTRACT(DOW FROM "stock_prices_weekly"."timestamp"::timestamptz AT TIME ZONE 'Etc/UTC')::integer) % 7)))::date