dashboard/app/controllers/home_controller.rb

SELECT SUM("stock_prices_daily"."close") AS "sum_close", to_char(timestamp, 'YYYY-MM') AS "to_char_timestamp_yyyy_mm" FROM "stock_prices_daily" GROUP BY to_char(timestamp, 'YYYY-MM')
---
  def daily
    symbol = params[:symbol] # Get the selected symbol from the filter

    if symbol.present? # If a symbol is selected, filter the data accordingly
      @chart_data = StockPricesDaily.where(symbol: symbol)
                    .group("to_char(timestamp, 'YYYY-MM')")
                    .sum(:close)
    else # If no symbol is selected, fetch all data
      @chart_data = StockPricesDaily.group("to_char(timestamp, 'YYYY-MM')")
                    .sum(:close)

SELECT "stock_prices_weekly"."symbol", MAX(close) AS recent_close, AVG(percent_change) AS percent_change FROM "stock_prices_weekly" WHERE "stock_prices_weekly"."symbol" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) GROUP BY "stock_prices_weekly"."symbol"  [["symbol", "AAPL"], ["symbol", "MSFT"], ["symbol", "GOOGL"], ["symbol", "AMZN"], ["symbol", "TSLA"], ["symbol", "AAA"], ["symbol", "SM"], ["symbol", "TEL"], ["symbol", "GLO"], ["symbol", "UBP"]]
SELECT "stock_prices_weekly"."symbol" FROM "stock_prices_weekly"
SELECT "stock_prices_weekly"."year_month", "stock_prices_weekly"."average_price" FROM "stock_prices_weekly" WHERE "stock_prices_weekly"."symbol" = $1  [["symbol", "AAPL"]]
SELECT "stock_prices_weekly"."year_month", "stock_prices_weekly"."average_price" FROM "stock_prices_weekly"
---
  def weekly
    # Default: All companies
    @weeklies = StockPricesWeekly.where(symbol: ['AAPL', 'MSFT', 'GOOGL', 'AMZN', 'TSLA', 'AAA', 'SM', 'TEL', 'GLO', 'UBP']).group(:symbol).group(:symbol)
    .select(:symbol)
    .select("MAX(close) AS recent_close")
    .select("AVG(percent_change) AS percent_change")

    # Region Filter
    if params[:filter].present?
      case params[:filter]
      when 'local'
        @weeklies = @weeklies.where(symbol: ['AAA', 'SM', 'TEL', 'GLO', 'UBP']).group(:symbol).select(:symbol).select("MAX(close) AS recent_close").select("AVG(percent_change) AS percent_change")
      when 'international'
        @weeklies = @weeklies.where(symbol: ['AAPL', 'MSFT', 'GOOGL', 'AMZN', 'TSLA']).group(:symbol).select(:symbol).select("MAX(close) AS recent_close").select("AVG(percent_change) AS percent_change")
      when 'all'
        @weeklies = @weeklies.where(symbol: ['AAPL', 'MSFT', 'GOOGL', 'AMZN', 'TSLA', 'AAA', 'SM', 'TEL', 'GLO', 'UBP']).group(:symbol).select(:symbol).select("MAX(close) AS recent_close").select("AVG(percent_change) AS percent_change")
      end
    end


    symbol = params[:symbol]
    @symbols = StockPricesWeekly.pluck(:symbol).uniq

    if params[:symbol].present?
      @selected_symbol = params[:symbol]
      @selected_symbol_data = StockPricesWeekly.where(symbol: @selected_symbol).pluck(:year_month, :average_price)
    else
      @selected_symbol_data = StockPricesWeekly.pluck(:year_month, :average_price)